(quail-define-package
 "colemak-russian" "Russian" "ru" nil
 "Russian-typewriter keyboard layout assuming that your default
keyboard layout is Colemak"
 nil t t t t nil nil nil nil nil t)

(quail-define-rules
 ("#" ?\") ;;;
 ("&" ?\?)
 ("0" ?%) ("-" ?-) ("=" ?\=) ("q" ?й) ("w" ?ц) ("f" ?у) ("p" ?к) ("g" ?е) ("j" ?н)("l" ?г)
 ("u" ?ш) ("y" ?щ) (";" ?з) ("[" ?х) ("]" ?ъ) ("\\" ?\)) ("a" ?ф) ("r" ?ы) ("s" ?в)
 ("t" ?а) ("d" ?п) ("h" ?р) ("n" ?о) ("e" ?л) ("i" ?д) ("o" ?ж) ("'" ?э) ("z" ?я) ("x" ?ч)
 ("c" ?с) ("v" ?м) ("b" ?и) ("k" ?т) ("m" ?ь) ("," ?б) ("." ?ю) ("~" ?[) ("`" ?]) ("~" ?+)
 ("§" ?ё) ("±" ?Ё)
 ("/" ?.) ("?" ?,)
 ("_" ?_)
 ("+" ?+) ("Q" ?Й) ("W" ?Ц) ("F" ?У) ("P" ?К) ("G" ?Е) ("J" ?Н) ("L" ?Г) ("U" ?Ш) ("Y" ?Щ)
 (":" ?З) ("C" ?С)
 ("{" ?Х) ("}" ?Ъ) ("|"?\() ("A" ?Ф) ("R" ?Ы) ("S" ?В) ("T" ?А) ("D" ?П) ("H" ?Р)
 ("N" ?О) ("E" ?Л) ("I" ?Д) ("O" ?Ж) ("\"" ?Э) ("Z" ?Я) ("V" ?Ч) ("X" ?Ч) ("C" ?М) ("B" ?И)
 ("K" ?Т) ("M"?Ь) ("<" ?Б) (">" ?Ю) )
